cask_args appDir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'edgedb/tap'

brew 'mas'
brew 'go'
# brew 'asdf' # Multiple Runtime Version Manager
brew 'nvm' # Node Version Manager
brew 'pyenv' # Python Version Manager
brew 'rbenv' # Ruby Version Manager
brew 'rust'
brew 'firebase-cli'
brew 'protobuf'
brew 'jsoncpp'
brew 'cocoapods'
brew 'edgedb/tap/edgedb-cli'
brew 'font-d2coding'

cask 'google-chrome'
cask 'chrome-remote-desktop-host'
cask 'iina'
cask 'iterm2'
cask 'docker'
cask 'swish'
cask 'fork'
cask 'balenaetcher'
cask 'obsidian'
cask 'temurin20' # OpenJDK
cask 'temurin17' # OpenJDK
cask 'temurin11' # OpenJDK
cask 'temurin8' # OpenJDK
cask 'visual-studio-code'
cask 'google-cloud-sdk'
cask 'intellij-idea'
cask 'android-studio'
cask 'flutter'
cask 'xcodes' # for install xcode(AppStore is slow)

mas 'Xcode', id: 497799835
mas '카카오톡', id: 869223134
mas 'Slack', id: 803453959
mas 'FinalCut Pro', id: 424389933

vscode "esbenp.prettier-vscode"
vscode "magicstack.edgedb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "tamasfe.even-better-toml"
vscode "withfig.fig"
